In [1]:
import pandas as pd

In [11]:
#SERIES 
#A Series is like a single column in a DataFrame.
values = [10,20,30,40,50]
s =pd.Series(values, index=['a','b','c','d','e'])

#DATAFRAME
#Concatenation of series

df = pd.DataFrame({
    'name' : ['Manish','Raj','Rahul','Ravi'],
    'age' : [25,26,27,28],
    'occupation' : ['Engineer','Doctor','Teacher','Businessman']
})

df = df.set_index('name')

In [15]:
df

        age   occupation
name
Manish   25     Engineer
Raj      26       Doctor
Rahul    27      Teacher
Ravi     28  Businessman

In [24]:
df1 = pd.DataFrame({
      'a' :[1,2,3]
}, index=[0,1,2])

df2 = pd.DataFrame({
     'a' :[4,5,6]
}, index=[1,2,0])

In [25]:
df1 + df2

   a
0  7
1  6
2  8

In [28]:
df = df.reset_index()

In [29]:
df

     name  age   occupation
0  Manish   25     Engineer
1     Raj   26       Doctor
2   Rahul   27      Teacher
3    Ravi   28  Businessman

In [34]:
df.to_csv('mydata.csv', index=None)

In [35]:
pd.read_csv('mydata.csv', index_col=0)

        age   occupation
name
Manish   25     Engineer
Raj      26       Doctor
Rahul    27      Teacher
Ravi     28  Businessman

In [36]:
df.to_json('mydata.json')

In [38]:
df.to_dict()

{'name': {0: 'Manish', 1: 'Raj', 2: 'Rahul', 3: 'Ravi'},
 'age': {0: 25, 1: 26, 2: 27, 3: 28},
 'occupation': {0: 'Engineer', 1: 'Doctor', 2: 'Teacher', 3: 'Businessman'}}